Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 140, 400)          4801200   
_________________________________________________________________
dropout (Dropout)            (None, 140, 400)          0         
_________________________________________________________________
conv1d (Conv1D)              (None, 140, 200)          240200    
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 46, 200)           0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 46, 200)           0         
_________________________________________________________________
dense (Dense)                (None, 46, 250)           50250     
_________________________________________________________________
flatten (Flatten)            (None, 11500)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 11501     
=================================================================
Total params: 5,103,151
Trainable params: 301,951
Non-trainable params: 4,801,200
_________________________________________________________________
None
